app/views/transaccion/_form.html.erb

SELECT id, cat_cuenta_id, "cuentaCodigo", "cuentaNombre" FROM "scr_cuenta"  GROUP BY id, cat_cuenta_id, "cuentaCodigo", "cuentaNombre"  ORDER BY "scr_cuenta"."cuentaCodigo" ASC
---
    <div class="controls">
     <%= f.select :cuenta, ScrCuentua.order('CAST("cuentaCodigo" AS TEXT)').all.collect { |p| [ p.cuentaCodigo.to_s+"-"+p.cuentaNombre, p.id ] }, include_blank: false %>