app/views/transaccion/_show.html.erb

SELECT  "scr_cuenta".* FROM "scr_cuenta"  WHERE "scr_cuenta"."id" = $1 LIMIT 1  [["id", 28]]
---
         </td>
         <% c = ScrCuentua.find(scr_transaccion.cuenta_id) %>