app/views/scr_bombeos/_form.html.erb

SELECT "scr_empleado".* FROM "scr_empleado"   ORDER BY "scr_empleado"."empleadoNombre" ASC
---
  <div class="field">
    Tecnico: <%= f.select :empleado_id, ScrEmpleado.order(:empleadoNombre).all.collect { |p| [ p.empleadoNombre+"  ".html_safe+p.empleadoApellido, p.id ] }, include_blank: false %>