app/views/scr_cuentuas/_form.html.erb

SELECT "scr_cuenta".* FROM "scr_cuenta"   ORDER BY "scr_cuenta"."cuentaNombre" ASC
---
    <%= f.label :Cuenta_de_orden_superior %><br>
    <%= f.select :cat_cuenta_id, ScrCuentua.order('CAST("cuentaCodigo" AS TEXT)').all.collect { |p| [ p.cuentaCodigo.to_s+"-"+p.cuentaNombre, p.id ] }, include_blank: true %>