app/views/scr_lecturas/_previo.html.erb

 <p>
  Fecha: <%= f.text_field :mes, id: "datepicker" %> Técnico: <%= f.select :tecnico, ScrEmpleado.order(:empleadoNombre).all.collect { |p| [ p.empleadoNombre+"  ".html_safe+p.empleadoApellido, p.id ] }, include_blank: false %> <%= f.submit "Fijar datos", class:"btn btn-mini btn-primary" %>
---
SELECT "scr_empleado".* FROM "scr_empleado"   ORDER BY "scr_empleado"."empleadoNombre" ASC