app/views/resumen/_financiero.html.erb

SELECT "scr_cobro".* FROM "scr_cobro"   ORDER BY "cobroNombre"
---
<script type="text/javascript">
$(document).ready(function () {
	<% @rubro.each do |data| %>
	 var g<%= data.id %> = [
		<% @total_cob.each do |var| %>
			<% if data.id == var.id %>
				[<%= var.Mes %>, <%= var.total*data.cobroValor %>],
			<% end %>
		<% end %>
	 ];
    <% end %>

    var data1 = [
		<% @rubro.each do |data| %>
			{ label: '<%= data.cobroNombre %>', data: g<%= data.id %> },
		<% end %>
    ];

    $.plot($("#rubro"), data1, {
        series: {
            lines: {
                show: true, fill: true