app/views/resumen/_socias.html.erb

      <td><%= t.telefonousuario %></td>
      <% c = ScrLocalidad.find(t.localidad_id) %>
---
SELECT  "scr_localidad".* FROM "scr_localidad"  WHERE "scr_localidad"."id" = $1 LIMIT 1  [["id", 13]]