app/views/scr_usuarios/show.html.erb

SELECT id, id, "nombrerol", "nombrerol" FROM "scr_rol"   ORDER BY "scr_rol"."id" ASC
---
  <%= form_for :scr_usuario, class:"form-horizontal row-fluid", multipart: true,  :url => { :action => :rol } do |f|  %>
   Rol: <%= f.select :estado_id, ScrRol.select('id, id, "nombrerol", "nombrerol"').order(:id).all.collect { |p| [ p.nombrerol, p.id ] }, include_blank: false %>