app/views/scr_organizacions/_form.html.erb

SELECT "scr_localidad".* FROM "scr_localidad"   ORDER BY "scr_localidad"."localidad_nombre" ASC
---
    <%= f.label :Localidad %><br>
    <%= f.select :localidad_id, ScrLocalidad.order(:localidad_nombre).all.collect { |p| [ p.localidad_nombre, p.id ] }, include_blank: true %>