app/views/scr_cargos/_form.html.erb

    <%= f.label :Cargo %><br>
    <%= f.select :cargo_id, ScrCargo.order(:cargoNombre).all.collect { |p| [ p.cargoNombre, p.id ] }, include_blank: true %>
---
SELECT "scr_cargo".* FROM "scr_cargo"   ORDER BY "scr_cargo"."cargoNombre" ASC