app/views/core/_cobros.html.erb

     <div class="input-append">
      <%= f.select :cdebe, ScrCuentua.order('CAST("cuentaCodigo" AS TEXT)').all.collect { |p| [ p.cuentaCodigo.to_s+"-"+p.cuentaNombre, p.id ] }, include_blank: false %>
---
SELECT "scr_cuenta".* FROM "scr_cuenta"   ORDER BY CAST("cuentaCodigo" AS TEXT)