app/controllers/core_controller.rb

  def autenticate
    #user = ScrUsuario.where('correousuario > ? OR "password" > ? ', 0, 0)
    @ScrUsuario = ScrUsuario.where('correousuario = ?', params['transacx']['user'])
---
SELECT "scr_usuario".* FROM "scr_usuario"  WHERE ( correousuario = 'tecnico@mail.com' AND password = '6b9d2a9a24d231e089d4312fcf27269e8fe261f69d64024d8b0c6e0ad14d6d61f2ed720c3ca3dcc29e22dc5c5e2b83c04b01c58ccb24f18b7738ffcffb73df7d' )