app/controllers/libro_controller.rb

  def index
    session[:roles] = "root contador administrador"
    acceso
    @scr_transaccions = ScrTransaccion.last(0)
      @lo = 0
    if params.has_key?(:transacx)
      @lo = 1
      fecha = params['transacx']['transaxFecha']
      @lo = params['transacx']['transaxFecha']
      if params['transacx']['transaxFecha'] != ""
        @scr_transaccions = ScrTransaccion.where('"transaxFecha" = ?', fecha).order('"transaxSecuencia", "transaxRegistro"')
---
SELECT  "scr_transaccion".* FROM "scr_transaccion"   ORDER BY "scr_transaccion"."id" DESC LIMIT 0
SELECT "scr_transaccion".* FROM "scr_transaccion"  WHERE ("transaxFecha" = '2015-01-12')  ORDER BY "transaxSecuencia", "transaxRegistro"