app/controllers/recibo_controller.rb

SELECT  "scr_det_factura".* FROM "scr_det_factura"  WHERE "scr_det_factura"."id" = $1 LIMIT 1  [["id", 210]]
SELECT  "scr_usuario".* FROM "scr_usuario"  WHERE "scr_usuario"."id" = $1 LIMIT 1  [["id", 25]]
---
  def set_factura(id)
    begin
      tmp = ScrDetFactura.find(id)
      @@cuenta = tmp.socio_id
      user = ScrUsuario.find(tmp.socio_id)

SELECT "scr_lectura".* FROM "scr_lectura"  WHERE ((date_part('month', now())-date_part('month',"fechaLectura")) = 1 AND l.socio_id = 25;)
---
  def set_lectura()
    begin
      tmp = ScrLectura.where("(date_part('month', now())-date_part('month',\"fechaLectura\")) = 1 AND socio_id = "+@@cuenta.to_s)