app/controllers/scr_localidads_controller.rb

  def index
    session[:roles] = "administrador"
    acceso
    @scr_localidads = ScrLocalidad.all
---
SELECT "scr_localidads".* FROM "scr_localidads"

  def create
    @scr_localidad = ScrLocalidad.new(scr_localidad_params)

    respond_to do |format|
      if @scr_localidad.save
---
INSERT INTO "scr_localidad" ("localidad_descripcion", "localidad_id", "localidad_lat", "localidad_lon", "localidad_nombre") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["localidad_descripcion", "Ahuachapán"], ["localidad_id", 1], ["localidad_lat", 0.0], ["localidad_lon", 0.0], ["localidad_nombre", "Ahuachapán"]]

  def destroy
    @scr_localidad.destroy
---
DELETE FROM "scr_localidad" WHERE "scr_localidad"."id" = $1  [["id", 17]]

    def set_scr_localidad
      @scr_localidad = ScrLocalidad.find(params[:id])
---
SELECT  "scr_localidad".* FROM "scr_localidad"  WHERE "scr_localidad"."id" = $1 LIMIT 1  [["id", 17]]