app/controllers/scr_marca_producs_controller.rb

SELECT "scr_marca_produc".* FROM "scr_marca_produc"
---
  def index
    @scr_marca_producs = ScrMarcaProduc.all

INSERT INTO "scr_marca_produc" ("marcaProducDescrip", "marcaProducNombre") VALUES ($1, $2) RETURNING "id"  [["marcaProducDescrip", "test"], ["marcaProducNombre", "test"]]
---
  def create
    @scr_marca_produc = ScrMarcaProduc.new(scr_marca_produc_params)

    respond_to do |format|
      if @scr_marca_produc.save

SELECT  "scr_marca_produc".* FROM "scr_marca_produc"  WHERE "scr_marca_produc"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_scr_marca_produc
      @scr_marca_produc = ScrMarcaProduc.find(params[:id])