app/controllers/scr_cat_organizacions_controller.rb

  def index
    @scr_cat_organizacions = ScrCatOrganizacion.all
---
SELECT "scr_cat_organizacion".* FROM "scr_cat_organizacion"

  def create
    @scr_cat_organizacion = ScrCatOrganizacion.new(scr_cat_organizacion_params)

    respond_to do |format|
      if @scr_cat_organizacion.save
---
INSERT INTO "scr_cat_organizacion" ("cOrgDescripcion", "cOrgNombre") VALUES ($1, $2) RETURNING "id"  [["cOrgDescripcion", "test\r\n"], ["cOrgNombre", "test"]]