app/controllers/scr_cobros_controller.rb

SELECT "scr_cobro".* FROM "scr_cobro"
---
  def index
    @scr_cobros = ScrCobro.all