app/controllers/scr_cloracions_controller.rb

SELECT "scr_cloracion".* FROM "scr_cloracion"
---
  def index
    session[:roles] = "tecnico"
    acceso
    @scr_cloracions = ScrCloracion.all

INSERT INTO "scr_cloracion" ("empleado_id", "fecha", "gramos", "hora", "localidad_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["empleado_id", 23], ["fecha", "2014-10-08"], ["gramos", nil], ["hora", "2014-11-07 23:03:00.000000"], ["localidad_id", 5]]
---
  def create
    @scr_cloracion = ScrCloracion.new(scr_cloracion_params)

    respond_to do |format|
      if @scr_cloracion.save

SELECT  "scr_cloracion".* FROM "scr_cloracion"  WHERE "scr_cloracion"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_scr_cloracion
      @scr_cloracion = ScrCloracion.find(params[:id])