app/controllers/scr_usuarios_controller.rb

  def index
    @scr_usuarios = ScrUsuario.all
---
SELECT "scr_usuario".* FROM "scr_usuario"

  def create
    time = Time.new

    #params[:registrousuario] = time.year time.month time.day time.hour time.min time.sec time.usec time.strftime("%Y-%m-%d %H:%M:%S")
    #params[:registrousuario] = time.strftime("%Y-%m-%d %H:%M:%S")
#    params[:salt] = Random.new_seed.to_s
    #params[:password] = params[:password].crypt("$6$" + params[:salt])
    #params[:password] = Digest::SHA512.hexdigest()

    @scr_usuario = ScrUsuario.new()
    @scr_usuario.username		= params[:scr_usuario][:username]
    @scr_usuario.salt			= Random.new_seed.to_s
    @scr_usuario.password		= Digest::SHA512.hexdigest(@scr_usuario.salt+params[:scr_usuario][:password])
    @scr_usuario.correousuario	= params[:scr_usuario][:correousuario]
    @scr_usuario.detalleuuario	= params[:scr_usuario][:detalleuuario]
    @scr_usuario.ultimavisitausuario = time.strftime("%Y-%m-%d %H:%M:%S")
    @scr_usuario.ipusuario		= request.remote_ip
    @scr_usuario.nombreusuario	= params[:scr_usuario][:nombreusuario]
    @scr_usuario.apellidousuario= params[:scr_usuario][:apellidousuario]
    @scr_usuario.telefonousuario= params[:scr_usuario][:telefonousuario]
    @scr_usuario.nacimientousuario = params[:scr_usuario][:nacimientousuario]
    @scr_usuario.latusuario		= params[:scr_usuario][:latusuario]
    @scr_usuario.lonusuario		= params[:scr_usuario][:lonusuario]
    @scr_usuario.lonusuario		= params[:scr_usuario][:lonusuario]
    @scr_usuario.sexousuario	= 3
    @scr_usuario.registrousuario= time.strftime("%Y-%m-%d %H:%M:%S")
    @scr_usuario.estado_id = params[:scr_usuario][:estado_id]
    @scr_usuario.localidad_id	= params[:scr_usuario][:localidad_id]
    uploaded_io = params[:scr_usuario][:imagenusuario]
    File.open(Rails.root.join('public', 'DzIBijcxalAbR85K6PSOxMNrsqfVl7B1', uploaded_io.original_filename), 'wb') do |file|
---
SELECT "scr_usuario".* FROM "scr_usuario"

    @scr_usuario.imagenusuario = uploaded_io.original_filename

    respond_to do |format|
      if @scr_usuario.save
---
UPDATE "scr_usuario" SET "orden" = $1 WHERE "scr_usuario"."id" = 197  [["orden", 1000]]

    def set_scr_usuario
      @scr_usuario = ScrUsuario.find(params[:id])
---
SELECT  "scr_usuario".* FROM "scr_usuario"  WHERE "scr_usuario"."id" = 197 LIMIT 1