app/controllers/scr_estados_controller.rb

  def index
    @scr_estados = ScrEstado.all
---
SELECT "scr_estados".* FROM "scr_estados"

  def create
    @scr_estado = ScrEstado.new(scr_estado_params)

    respond_to do |format|
      if @scr_estado.save
---
INSERT INTO "scr_estado" ("nombreEstado") VALUES ($1) RETURNING "id"  [["nombreEstado", "Activo"]]

    def set_scr_estado
      @scr_estado = ScrEstado.find(params[:id])
---
SELECT  "scr_estado".* FROM "scr_estado"  WHERE "scr_estado"."id" = $1 LIMIT 1  [["id", 1]]