app/controllers/scr_usuarios_controller.rb

  def orden
    if params.has_key?(:scr_usuario)
		if params[:scr_usuario][:idorden].to_i > 0
			user = ScrUsuario.find_by(id: params[:scr_usuario][:idorden])
			user.update(orden: params[:scr_usuario][:orden])
---
UPDATE "scr_usuario" SET "orden" = $1 WHERE "scr_usuario"."id" = 197  [["orden", 87]]