app/controllers/scr_cargos_controller.rb

  def index
    session[:roles] = "root administrador"
    acceso
    @scr_cargos = ScrCargo.all
---
SELECT "scr_cargos".* FROM "scr_cargos"

  def create
    @scr_cargo = ScrCargo.new(scr_cargo_params)

    respond_to do |format|
      if @scr_cargo.save
---
INSERT INTO "scr_cargo" ("cargoDescripcion", "cargoNombre", "cargoSalario", "cargo_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cargoDescripcion", "test"], ["cargoNombre", "test"], ["cargoSalario", 12.0], ["cargo_id", 1]]

  def update
    respond_to do |format|
      if @scr_cargo.update(scr_cargo_params)
---
UPDATE "scr_cargo" SET "cargoDescripcion" = $1, "cargoSalario" = $2, "cargo_id" = $3 WHERE "scr_cargo"."id" = 1  [["cargoDescripcion", "none"], ["cargoSalario", 200.0], ["cargo_id", 1]]

    def set_scr_cargo
      @scr_cargo = ScrCargo.find(params[:id])
---
SELECT  "scr_cargo".* FROM "scr_cargo"  WHERE "scr_cargo"."id" = $1 LIMIT 1  [["id", 1]]