app/controllers/scr_cuentuas_controller.rb

SELECT "scr_cuentuas".* FROM "scr_cuentuas"
---
  def index
    session[:roles] = "root contador administrador"
    acceso
    @scr_cuentuas = ScrCuentua.all.order('CAST("cuentaCodigo" AS TEXT)')