app/controllers/scr_cat_actividads_controller.rb

  def index
    @scr_cat_actividads = ScrCatActividad.all
---
SELECT "scr_cat_actividad".* FROM "scr_cat_actividad"

  def create
    @scr_cat_actividad = ScrCatActividad.new(scr_cat_actividad_params)

    respond_to do |format|
      if @scr_cat_actividad.save
---
INSERT INTO "scr_cat_actividad" ("cActividadNombre", "catActividadDescripcion") VALUES ($1, $2) RETURNING "id"  [["cActividadNombre", "asd"], ["catActividadDescripcion", "asd"]]

    def set_scr_cat_actividad
      @scr_cat_actividad = ScrCatActividad.find(params[:id])
---
SELECT  "scr_cat_actividad".* FROM "scr_cat_actividad"  WHERE "scr_cat_actividad"."id" = $1 LIMIT 1  [["id", 2]]