app/controllers/scr_bombeos_controller.rb

  def index
    session[:roles] = "tecnico"
    acceso
    @scr_bombeos = ScrBombeo.all
---
SELECT "scr_bombeo".* FROM "scr_bombeo"

  def create
    @scr_bombeo = ScrBombeo.new(scr_bombeo_params)

    respond_to do |format|
      if @scr_bombeo.save
---
INSERT INTO "scr_bombeo" ("bombeo_fin", "bombeo_inicio", "empleado_id") VALUES ($1, $2, $3) RETURNING "id"  [["bombeo_fin", "2014-11-07 23:00:00.000000"], ["bombeo_inicio", "2014-11-07 23:00:00.000000"], ["empleado_id", 23]]

    def set_scr_bombeo
      @scr_bombeo = ScrBombeo.find(params[:id])
---
SELECT  "scr_bombeo".* FROM "scr_bombeo"  WHERE "scr_bombeo"."id" = $1 LIMIT 1  [["id", 1]]