app/controllers/scr_det_contables_controller.rb

SELECT "scr_det_contable".* FROM "scr_det_contable"
---
  def index
    @scr_det_contables = ScrDetContable.all