app/controllers/scr_bancos_controller.rb

SELECT "scr_banco".* FROM "scr_banco"
---
  def index
    session[:roles] = "root"
    acceso
    @scr_bancos = ScrBanco.all

INSERT INTO "scr_banco" ("banco_nombre") VALUES ($1) RETURNING "id"  [["banco_nombre", "abc"]]
---
  def create
    @scr_banco = ScrBanco.new(scr_banco_params)

    respond_to do |format|
      if @scr_banco.save

SELECT  "scr_banco".* FROM "scr_banco"  WHERE "scr_banco"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_scr_banco
      @scr_banco = ScrBanco.find(params[:id])