app/controllers/scr_usuario_rols_controller.rb

  def index
    session[:roles] = " root "
    @scr_usuario_rols = ScrUsuarioRol.all
---
SELECT "scr_usuario_rol".* FROM "scr_usuario_rol"

    def set_scr_usuario_rol
      @scr_usuario_rol = ScrUsuarioRol.find(params[:id])
---
SELECT  "scr_rol".* FROM "scr_rol"  WHERE "scr_rol"."id" = $1 LIMIT 1  [["id", 5]]