app/controllers/scr_det_facturas_controller.rb

SELECT "scr_det_factura".* FROM "scr_det_factura"   ORDER BY "scr_det_factura"."id" ASC
---
  def index
    @scr_det_facturas = ScrDetFactura.all.order(id: :asc)