app/controllers/scr_lecturas_controller.rb

SELECT "scr_lectura".* FROM "scr_lectura"   ORDER BY "scr_lectura"."fechaLectura" DESC
---
  def index
    session[:roles] = "tecnico"
    acceso
    @scr_lecturas = ScrLectura.all.order(fechaLectura: :desc)