app/controllers/scr_organizacions_controller.rb

  def index
    @scr_organizacions = ScrOrganizacion.all
---
SELECT "scr_organizacions".* FROM "scr_organizacions"

  def create
    @scr_organizacion = ScrOrganizacion.new(scr_organizacion_params)

    respond_to do |format|
      if @scr_organizacion.save
---
INSERT INTO "scr_organizacion" ("localidad_id", "organizacionDescripcion", "organizacionNombre") VALUES ($1, $2, $3) RETURNING "id"  [["localidad_id", nil], ["organizacionDescripcion", ""], ["organizacionNombre", ""]]

  def update
    respond_to do |format|
      if @scr_organizacion.update(scr_organizacion_params)
---
UPDATE "scr_organizacion" SET "organizacionDescripcion" = $1, "organizacionNombre" = $2 WHERE "scr_organizacion"."id" = 2  [["organizacionDescripcion", "Asociacion de ..."], ["organizacionNombre", "ACRASAME"]]

  def destroy
    @scr_organizacion.destroy
---
DELETE FROM "scr_organizacion" WHERE "scr_organizacion"."id" = $1  [["id", 14]]

    def set_scr_organizacion
      @scr_organizacion = ScrOrganizacion.find(params[:id])
---
SELECT  "scr_organizacion".* FROM "scr_organizacion"  WHERE "scr_organizacion"."id" = $1 LIMIT 1  [["id", 14]]