app/controllers/transaccion_controller.rb

  def index
    session[:roles] = " root Contabilidad "
    acceso
    @scr_transaccion = ScrTransaccion.new
    @scr_transaccions = ScrTransaccion.all.order('"transaxSecuencia", "transaxFecha"')
---
SELECT "scr_transaccion".* FROM "scr_transaccion"   ORDER BY "transaxSecuencia", "transaxFecha"