app/views/scr_cloracions/_form.html.erb

SELECT "scr_localidad".* FROM "scr_localidad"   ORDER BY "scr_localidad"."localidad_nombre" ASC
---
  <div class="field">
    Localidad: <%= f.select :localidad_id, ScrLocalidad.order(:localidad_nombre).all.collect { |p| [ p.localidad_nombre, p.id ] }, include_blank: false %>

SELECT "scr_empleado".* FROM "scr_empleado"   ORDER BY "scr_empleado"."empleadoNombre" ASC
---
  <div class="field">
    Tecnico: <%= f.select :empleado_id, ScrEmpleado.order(:empleadoNombre).all.collect { |p| [ p.empleadoNombre+"  ".html_safe+p.empleadoApellido, p.id ] }, include_blank: false %>